; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=219, out_folder=htg/blocksworld/training, instance_id=33, seed=2057, goal_proportion=0.03

(define (problem blocksworld-33)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 - object)
 (:init 
    (arm-empty)
    (clear b51)
    (on b51 b115)
    (on b115 b54)
    (on b54 b125)
    (on b125 b14)
    (on-table b14)
    (clear b182)
    (on b182 b47)
    (on-table b47)
    (clear b187)
    (on b187 b186)
    (on b186 b106)
    (on-table b106)
    (clear b149)
    (on-table b149)
    (clear b52)
    (on b52 b114)
    (on b114 b11)
    (on b11 b141)
    (on b141 b2)
    (on b2 b27)
    (on b27 b174)
    (on b174 b13)
    (on b13 b105)
    (on b105 b93)
    (on-table b93)
    (clear b190)
    (on-table b190)
    (clear b8)
    (on b8 b110)
    (on b110 b191)
    (on b191 b56)
    (on-table b56)
    (clear b67)
    (on b67 b12)
    (on b12 b104)
    (on b104 b197)
    (on-table b197)
    (clear b184)
    (on b184 b109)
    (on b109 b164)
    (on b164 b127)
    (on-table b127)
    (clear b35)
    (on b35 b153)
    (on-table b153)
    (clear b198)
    (on b198 b55)
    (on-table b55)
    (clear b86)
    (on b86 b139)
    (on b139 b138)
    (on b138 b179)
    (on b179 b21)
    (on b21 b85)
    (on-table b85)
    (clear b160)
    (on b160 b158)
    (on-table b158)
    (clear b18)
    (on b18 b88)
    (on b88 b123)
    (on-table b123)
    (clear b173)
    (on b173 b49)
    (on b49 b24)
    (on-table b24)
    (clear b209)
    (on-table b209)
    (clear b204)
    (on-table b204)
    (clear b168)
    (on-table b168)
    (clear b212)
    (on b212 b62)
    (on-table b62)
    (clear b20)
    (on-table b20)
    (clear b122)
    (on-table b122)
    (clear b10)
    (on-table b10)
    (clear b116)
    (on b116 b185)
    (on b185 b72)
    (on-table b72)
    (clear b144)
    (on-table b144)
    (clear b154)
    (on b154 b22)
    (on b22 b31)
    (on-table b31)
    (clear b78)
    (on b78 b53)
    (on b53 b117)
    (on b117 b82)
    (on-table b82)
    (clear b94)
    (on-table b94)
    (clear b17)
    (on-table b17)
    (clear b58)
    (on-table b58)
    (clear b150)
    (on-table b150)
    (clear b60)
    (on b60 b140)
    (on b140 b3)
    (on b3 b73)
    (on b73 b136)
    (on b136 b130)
    (on-table b130)
    (clear b37)
    (on b37 b219)
    (on b219 b92)
    (on b92 b126)
    (on b126 b33)
    (on b33 b79)
    (on b79 b74)
    (on b74 b80)
    (on b80 b169)
    (on-table b169)
    (clear b120)
    (on b120 b142)
    (on b142 b119)
    (on-table b119)
    (clear b203)
    (on b203 b195)
    (on b195 b162)
    (on b162 b192)
    (on b192 b30)
    (on b30 b205)
    (on b205 b216)
    (on b216 b4)
    (on b4 b167)
    (on b167 b63)
    (on b63 b145)
    (on b145 b64)
    (on-table b64)
    (clear b207)
    (on b207 b26)
    (on b26 b96)
    (on b96 b152)
    (on-table b152)
    (clear b194)
    (on-table b194)
    (clear b157)
    (on b157 b131)
    (on b131 b25)
    (on-table b25)
    (clear b211)
    (on b211 b170)
    (on b170 b200)
    (on b200 b107)
    (on b107 b57)
    (on b57 b134)
    (on b134 b23)
    (on-table b23)
    (clear b46)
    (on b46 b163)
    (on b163 b189)
    (on b189 b214)
    (on b214 b124)
    (on-table b124)
    (clear b39)
    (on b39 b91)
    (on b91 b19)
    (on b19 b44)
    (on b44 b68)
    (on b68 b41)
    (on b41 b101)
    (on b101 b71)
    (on b71 b159)
    (on b159 b111)
    (on b111 b34)
    (on-table b34)
    (clear b50)
    (on b50 b5)
    (on b5 b100)
    (on b100 b43)
    (on b43 b188)
    (on b188 b98)
    (on b98 b151)
    (on-table b151)
    (clear b76)
    (on b76 b166)
    (on b166 b129)
    (on b129 b45)
    (on b45 b181)
    (on b181 b42)
    (on b42 b1)
    (on-table b1)
    (clear b132)
    (on b132 b135)
    (on b135 b75)
    (on b75 b196)
    (on b196 b213)
    (on-table b213)
    (clear b165)
    (on-table b165)
    (clear b178)
    (on-table b178)
    (clear b143)
    (on b143 b176)
    (on-table b176)
    (clear b199)
    (on b199 b113)
    (on-table b113)
    (clear b108)
    (on b108 b15)
    (on b15 b97)
    (on-table b97)
    (clear b66)
    (on-table b66)
    (clear b99)
    (on b99 b81)
    (on b81 b29)
    (on b29 b59)
    (on b59 b90)
    (on b90 b217)
    (on b217 b121)
    (on b121 b103)
    (on b103 b84)
    (on b84 b155)
    (on b155 b177)
    (on b177 b146)
    (on-table b146)
    (clear b133)
    (on b133 b87)
    (on b87 b172)
    (on b172 b128)
    (on b128 b208)
    (on-table b208)
    (clear b218)
    (on b218 b89)
    (on b89 b147)
    (on b147 b36)
    (on-table b36)
    (clear b112)
    (on b112 b210)
    (on-table b210)
    (clear b171)
    (on b171 b7)
    (on b7 b32)
    (on b32 b215)
    (on b215 b9)
    (on b9 b180)
    (on b180 b70)
    (on-table b70)
    (clear b48)
    (on b48 b95)
    (on b95 b61)
    (on-table b61)
    (clear b77)
    (on b77 b202)
    (on b202 b83)
    (on b83 b65)
    (on b65 b6)
    (on b6 b38)
    (on b38 b175)
    (on-table b175)
    (clear b201)
    (on-table b201)
    (clear b102)
    (on b102 b148)
    (on b148 b28)
    (on b28 b137)
    (on-table b137)
    (clear b40)
    (on b40 b161)
    (on b161 b16)
    (on-table b16)
    (clear b206)
    (on b206 b156)
    (on-table b156)
    (clear b193)
    (on-table b193)
    (clear b69)
    (on b69 b118)
    (on b118 b183)
    (on-table b183))
 (:goal  (and 
    (clear b4)
    (on b4 b1)
    (on b1 b2)
    (on b2 b5)
    (on b5 b6)
    (on b6 b3)
    (on-table b3))))

; plan
1. (unstack b203 b195)
   deleted: (on b203 b195) (clear b203) (arm-empty)
   added: (holding b203) (clear b195)
   goals met: 0 of 7
2. (putdown b203)
   deleted: (holding b203)
   added: (clear b203) (arm-empty) (on-table b203)
   goals met: 0 of 7
3. (unstack b195 b162)
   deleted: (on b195 b162) (clear b195) (arm-empty)
   added: (holding b195) (clear b162)
   goals met: 0 of 7
4. (putdown b195)
   deleted: (holding b195)
   added: (clear b195) (arm-empty) (on-table b195)
   goals met: 0 of 7
5. (unstack b162 b192)
   deleted: (on b162 b192) (clear b162) (arm-empty)
   added: (holding b162) (clear b192)
   goals met: 0 of 7
6. (putdown b162)
   deleted: (holding b162)
   added: (clear b162) (arm-empty) (on-table b162)
   goals met: 0 of 7
7. (unstack b192 b30)
   deleted: (on b192 b30) (clear b192) (arm-empty)
   added: (holding b192) (clear b30)
   goals met: 0 of 7
8. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 0 of 7
9. (unstack b30 b205)
   deleted: (on b30 b205) (clear b30) (arm-empty)
   added: (holding b30) (clear b205)
   goals met: 0 of 7
10. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 0 of 7
11. (unstack b205 b216)
   deleted: (on b205 b216) (clear b205) (arm-empty)
   added: (holding b205) (clear b216)
   goals met: 0 of 7
12. (putdown b205)
   deleted: (holding b205)
   added: (clear b205) (arm-empty) (on-table b205)
   goals met: 0 of 7
13. (unstack b216 b4)
   deleted: (on b216 b4) (clear b216) (arm-empty)
   added: (holding b216) (clear b4)
   goals met: 1 of 7
14. (putdown b216)
   deleted: (holding b216)
   added: (clear b216) (arm-empty) (on-table b216)
   goals met: 1 of 7
15. (unstack b50 b5)
   deleted: (on b50 b5) (clear b50) (arm-empty)
   added: (holding b50) (clear b5)
   goals met: 1 of 7
16. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 1 of 7
17. (unstack b52 b114)
   deleted: (on b52 b114) (clear b52) (arm-empty)
   added: (holding b52) (clear b114)
   goals met: 1 of 7
18. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 1 of 7
19. (unstack b114 b11)
   deleted: (on b114 b11) (clear b114) (arm-empty)
   added: (holding b114) (clear b11)
   goals met: 1 of 7
20. (putdown b114)
   deleted: (holding b114)
   added: (clear b114) (arm-empty) (on-table b114)
   goals met: 1 of 7
21. (unstack b11 b141)
   deleted: (on b11 b141) (clear b11) (arm-empty)
   added: (holding b11) (clear b141)
   goals met: 1 of 7
22. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 7
23. (unstack b141 b2)
   deleted: (on b141 b2) (clear b141) (arm-empty)
   added: (holding b141) (clear b2)
   goals met: 1 of 7
24. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 1 of 7
25. (unstack b60 b140)
   deleted: (on b60 b140) (clear b60) (arm-empty)
   added: (holding b60) (clear b140)
   goals met: 1 of 7
26. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 1 of 7
27. (unstack b140 b3)
   deleted: (on b140 b3) (clear b140) (arm-empty)
   added: (holding b140) (clear b3)
   goals met: 1 of 7
28. (putdown b140)
   deleted: (holding b140)
   added: (clear b140) (arm-empty) (on-table b140)
   goals met: 1 of 7
29. (unstack b3 b73)
   deleted: (on b3 b73) (clear b3) (arm-empty)
   added: (holding b3) (clear b73)
   goals met: 1 of 7
30. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 7
31. (unstack b76 b166)
   deleted: (on b76 b166) (clear b76) (arm-empty)
   added: (holding b76) (clear b166)
   goals met: 2 of 7
32. (putdown b76)
   deleted: (holding b76)
   added: (clear b76) (arm-empty) (on-table b76)
   goals met: 2 of 7
33. (unstack b166 b129)
   deleted: (on b166 b129) (clear b166) (arm-empty)
   added: (holding b166) (clear b129)
   goals met: 2 of 7
34. (putdown b166)
   deleted: (holding b166)
   added: (clear b166) (arm-empty) (on-table b166)
   goals met: 2 of 7
35. (unstack b129 b45)
   deleted: (on b129 b45) (clear b129) (arm-empty)
   added: (holding b129) (clear b45)
   goals met: 2 of 7
36. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 2 of 7
37. (unstack b45 b181)
   deleted: (on b45 b181) (clear b45) (arm-empty)
   added: (holding b45) (clear b181)
   goals met: 2 of 7
38. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 2 of 7
39. (unstack b181 b42)
   deleted: (on b181 b42) (clear b181) (arm-empty)
   added: (holding b181) (clear b42)
   goals met: 2 of 7
40. (putdown b181)
   deleted: (holding b181)
   added: (clear b181) (arm-empty) (on-table b181)
   goals met: 2 of 7
41. (unstack b42 b1)
   deleted: (on b42 b1) (clear b42) (arm-empty)
   added: (holding b42) (clear b1)
   goals met: 2 of 7
42. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 2 of 7
43. (unstack b77 b202)
   deleted: (on b77 b202) (clear b77) (arm-empty)
   added: (holding b77) (clear b202)
   goals met: 2 of 7
44. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 2 of 7
45. (unstack b202 b83)
   deleted: (on b202 b83) (clear b202) (arm-empty)
   added: (holding b202) (clear b83)
   goals met: 2 of 7
46. (putdown b202)
   deleted: (holding b202)
   added: (clear b202) (arm-empty) (on-table b202)
   goals met: 2 of 7
47. (unstack b83 b65)
   deleted: (on b83 b65) (clear b83) (arm-empty)
   added: (holding b83) (clear b65)
   goals met: 2 of 7
48. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 2 of 7
49. (unstack b65 b6)
   deleted: (on b65 b6) (clear b65) (arm-empty)
   added: (holding b65) (clear b6)
   goals met: 2 of 7
50. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 2 of 7
51. (unstack b6 b38)
   deleted: (on b6 b38) (clear b6) (arm-empty)
   added: (holding b6) (clear b38)
   goals met: 2 of 7
52. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 3 of 7
53. (unstack b5 b100)
   deleted: (on b5 b100) (clear b5) (arm-empty)
   added: (holding b5) (clear b100)
   goals met: 3 of 7
54. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 4 of 7
55. (unstack b2 b27)
   deleted: (on b2 b27) (clear b2) (arm-empty)
   added: (holding b2) (clear b27)
   goals met: 4 of 7
56. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 5 of 7
57. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 7
58. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 6 of 7
59. (unstack b4 b167)
   deleted: (on b4 b167) (clear b4) (arm-empty)
   added: (holding b4) (clear b167)
   goals met: 5 of 7
60. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 7 of 7
